In [2]:
import pandas as pd

In [5]:
s1 = pd.Series([71, 84, 56, 23, 56, 98, 56])

In [6]:
type(s1)

pandas.core.series.Series

In [7]:
print(s1)

0    71
1    84
2    56
3    23
4    56
5    98
6    56
dtype: int64

In [11]:
s2 = pd.Series([71, 84, 56, 23, 56, 98, 56], index=["Harry", "Shubh", "Rohan", "Akash", "Kirti", "John", "Rehan"])

In [12]:
s2

Harry    71
Shubh    84
Rohan    56
Akash    23
Kirti    56
John     98
Rehan    56
dtype: int64

In [13]:
s2["Harry"]

np.int64(71)

In [14]:
data = {
    "name": ["Alice", "Bob", "Charlie"],
    "age": [25, 30, 35],
    "city": ["Delhi", "Mumbai", "Bangalore"]
}

In [16]:
 df = pd.DataFrame(data)

In [17]:
df

      name  age       city
0    Alice   25      Delhi
1      Bob   30     Mumbai
2  Charlie   35  Bangalore

In [18]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [19]:
df.columns

Index(['name', 'age', 'city'], dtype='object')